import type { ISupportTopic } from "@/features/task/types";

export const topics: ISupportTopic[] = [
  {
    id: 1,
    title: "Вопрос по расчету и начислению ЗП",
    text: "Вопросы связанные с начислениями и выплатой заработной платы, аванса, премий и т.д.",
  },
  {
    id: 2,
    title: "Корректировка реквизитов для начисления ЗП",
    text: "Любая корректировка финансовых реквизитов сотрудников",
  },
  {
    id: 3,
    title: "Запрос справок и информации",
    text: "Любые вопросы, требующие получения информации от бухгалтерии или кадровой службы",
  },
  {
    id: 4,
    title: "Переработки и премии за месяц",
    text: "Обращения связанные с переработками или информацией по премиям за месяц",
  },
  {
    id: 5,
    title: "Другое",
    text: "Прочие вопросы, которые нельзя однозначно определить по теме",
  },
  {
    id: 6,
    title: "Изменение ЗП",
    text: "Любые обращения по корректировкам, связанным с суммами к выплате по ФОТ",
  },
  {
    id: 8,
    title: "Вопрос по оплатам",
    text: "Любые вопросы связанные с оплатами",
  },
  {
    id: 9,
    title: "Займ",
    text: "Вопрос по займам, выданным компанией",
  },
  {
    id: 10,
    title: "Увольнение",
    text: "Данные для расчета сотрудника при увольнении",
  },
  {
    id: 11,
    title: "Сдача техники",
    text: "Фиксация сдачи техники сотрудником",
  },
  {
    id: 12,
    title: "Перевод сотрудника",
    text: "Инициация первода сотрудника между отделами/продуктами",
  },
  {
    id: 13,
    title: "Регистрация сотрудника",
    text: "Регистрация нового сотрудника",
  },
  {
    id: 14,
    title: "Предоставление документов по оплатам",
    text: "Предоставление отчетных (закрывающих) документов при оплате через заявки на оплаты",
  },
  {
    id: 15,
    title: "Уведомление об увольнении",
    text: "Информирование о начале процесса по увольнению сотрудника",
  },
  {
    id: 16,
    title: "Pay.aya: Баги, замечания, предложения по функционалу",
    text: "Все вопросы, связанные с работоспособностью системы Pay.aya",
  },
  {
    id: 17,
    title: "Pay.aya: Доступы, права",
    text: "Вопросы связанные с предоставлением новых доступов, открытия данных по ролевой модели и т.д.",
  },
];
